{"inkVersion":20,"root":[[{"->":"SQUARE"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"SQUARE":[["^You are walking slowly through the desert square. Two steps forward, right in the center of the mosaic that spreads under your feet.","\n","^You position your legs at a 90° angle as your head rises, looking at the rooftops all around you.","\n","^Player?normal \"He is definetly the showoff type, it's impossible for him to be coming from the main street.\"","\n","^DONG","\n","^The giant clock that faces the square strikes noon as you hear the low sound of the bells covering all the noises for a few moments.","\n","^SWOOSH","\n","^You barely notice the air moving behind you but, your hand, quickly moves to block an object from reaching your head.","\n","^It's a black glove. Of course he had to do that.","\n","^You turn to look behind and you see a masked figure jumping off a roof.","\n","^His dark cloak moves in the air as if he had wings while he elegantly finishes his jump in what almost looks like a bow.","\n","^Player?normal \"Rignt on time ... as always.\"","\n","^Mist?normal \"Of course milady, I wouldn't lose a second of our gallant date.\"","\n","^In a fluid motion, the man dressed in black uncovers a rapier from underneath the cloak, whose fabric moves once again with his elegant figure.","\n","^The blade rapidly strikes against the sheath as you hear the swiflty sound of the metal.","\n","^Mist?normal \"En garde.\"","\n","^Your hand runs to the handle of your sword and you're quick to follow your rival in his deadly dance.","\n","^The two of you start to move slowly in a circular motion, letting the blades timidly touch each other every now and then.","\n","^His movements are very well calculated, you can tell from the way he's always just outside of you reach.","\n","ev","str","^Study his movements and take a defensive position","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Try to get on an advantaged position.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.loose_wrist"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.elusion"},{"#f":5}]}],{"loose_wrist":["^You remain far enough from his sword, teasing the blade to study his reaction.","\n","^He has a loose wrist, you quickly notice that; he's inclined to change the position of his sword at the slightest pressure.","\n",{"->":".^.^.first_move"},{"#f":1}],"elusion":["^You take a step forward, using your sword to slightly move his out of trajectory.","\n","^Well, you try to. He was clearly expecting that and your blades never really touch as he quickly moves his sword to not be dominated by yours.","\n",{"->":".^.^.first_move"},{"#f":1}],"first_move":[["^He's still out of reach but, by how he's moving, you deduce that he's done studying you and ready to take action.","\n","^You have to choose for a strategy.","\n","ev","str","^Wait for him to attack","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Try to dominate his sword","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.faint"},{"#f":5}],"c-1":["\n","ev",{"CNT?":"SQUARE.loose_wrist"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"SQUARE.advantaged_position"},{"->":".^.^.^.5"},null]}],"nop","\n",{"->":"SQUARE.arm_cut"},{"#f":5}]}],{"#f":1}],"faint":[["^You position your sword to leave a hole in your defenses, expecting him to attack there; and he does, but, just when you start to parry, his blade changes direction. A faint ... definetly sounds like him.","\n","^You manage to block his jab just in time, taking a step back in the process.","\n","^After that attack, comes another, and another again, while you start to go backward, parrying with increasing difficulty.","\n","ev","str","^Try to break his timing","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Step back and parry","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.he_jumps"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.he_faster"},{"#f":5}]}],{"#f":1}],"advantaged_position":[["^You decisively move his sword to the side, using the strong side of your blade to apply more pressure.","\n","^As you were expecting, he rapidly changes the position of his sword and tries to attack you. You were ready and parry effortlessly, moving your blade forward in a dominant position.","\n","ev","str","^Force his sword again and finish","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Feint","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.you_disengage"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.he_jumps"},{"#f":5}]}],{"#f":1}],"arm_cut":["^You decisively move his sword to the side, using the strong side of your blade to apply more pressure.","\n","^Your blades were almost touching, when he rapidly changes the position of his and attacks you from the other side.","\n","^Caught completely unaware, you barely manage to parry while the slight contact with the blade leaves a cut on your right shoulder.","\n","^After that attack, comes another, and another again, while you start to go backward, parrying with increasing difficulty.","\n",{"->":".^.^.he_faster"},{"#f":1}],"he_faster":[["^You continue to ","ev",{"CNT?":"SQUARE.arm_cut"},"/ev",[{"->":".^.b","c":true},{"b":["^block his jabs",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["^parry",{"->":".^.^.^.6"},null]}],"nop","^ but the ","ev",{"CNT?":"SQUARE.arm_cut"},"/ev",[{"->":".^.b","c":true},{"b":["^wound hurts and you're not able to rapidly react.",{"->":".^.^.^.13"},null]}],[{"->":".^.b"},{"b":["^situation starts to get out of hand.",{"->":".^.^.^.13"},null]}],"nop","\n","^He's getting faster with his attacks. Quick!","\n","ev","str","^Disengage","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Parry and reply","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.you_disengage"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.continue_parry"},{"#f":5}]}],{"#f":1}],"he_jumps":[["^You let him think you'll hit him on the spot you were already positioned for; he expected just that and parryes, while you elude his defense to change line of action and hit him on the other side.","\n","^He jumps back parrying once again but it was definetly an emergency move.","\n","ev","str","^Follow his movement and attack","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Prepare to parry","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.follow"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.last_chance"},{"#f":5}]}],{"#f":1}],"you_disengage":[["^With a burst of energy, you perform a double step back and succesfully disengage by jumping on the side.","\n","^You are out of energy ","ev",{"CNT?":"SQUARE.arm_cut"},"/ev",[{"->":".^.b","c":true},{"b":["^and the wound feels like it's burning",{"->":".^.^.^.7"},null]}],"nop","^, you can't handle a situation like the one you just escaped from again... and he knows.","\n","^He's definetly going to attack you once more.","\n","ev","str","^Try to hit him on time","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Prepare to parry","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.intrecciata"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.last_chance"},{"#f":5}]}],{"#f":1}],"last_chance":[["^You look at his every little movement, ready to parry as soon as his blade moves towards you...","\n","^Here it is! his muscles tending leaves no doubt, the moment is now!","\n","^You notice his sword delicately sliding on yours and completely changing the angle at wich his blade enters, but your mind is focused and ready. You react quickly and block his sword onto yours.","\n","ev","str","^Attack!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Wait for the right moment to attack","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"SQUARE.attack"},{"#f":5}],"c-1":["\n",{"->":"SQUARE.wait"},{"#f":5}]}],{"#f":1}],"continue_parry":["^You continue to parry, searching for the right moment to reply. While you step backwards, your defense gets weaker at every move.","\n","^Suddenly, he breacks the timing and attacks you with decision.","\n",{"->":".^.^.LOSE"},{"#f":1}],"follow":["^As he moves backwards, you follow his body with your sword in a unic, fluid motion; your blade perfectly intersecting with his.","\n",{"->":"WIN"},{"#f":1}],"intrecciata":["^You look at his every little movement, ready to jump forward as soon as his blade moves towards you...","\n","^Here it is! his muscles tending leaves no doubt, the moment is now!","\n","^You attack with all your remaining energy, positioning your sword at an angle to move his to the side.","\n",{"->":".^.^.LOSE"},{"#f":1}],"attack":["^You can't wait any longer.","\n","^As soon as you feel his sword touching yours, you burst forward, extending your arm almost automatically.","\n",{"->":"WIN"},{"#f":1}],"wait":["^You look at him, just for a few seconds, searching for the right moment to attack.","\n","^It was too much; his sword slides onto yours and now, he regained domain over your blade. He attacks you with speed and decision.","\n",{"->":".^.^.LOSE"},{"#f":1}],"LOSE":["ev",{"CNT?":".^.^.intrecciata"},"/ev",[{"->":".^.b","c":true},{"b":["^...The sharp end of his blade points right at your face. His sword delicately slided on yours in a way that you did't expect at all, completely changing the angle at wich the blade entered your defenses.",{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["^...His sword points right at your face.",{"->":".^.^.^.5"},null]}],"nop","\n","^He defeated you.","\n","^You look at him right in the eyes that boldly shines, in contrast with the black mask. They are of a piercing grey that is the one of the sky during a storm.","\n","^Mist?normal \"You have a lot to learn milady, but your technique isn't bad.\"","\n","^The masked steps back and sheats his blade, while he continues to look at you.","\n","^You hear some footsteps in the distance along with the sound of swords and armors clashing each other in the motion.","\n","^The guards are arriving, someone must have seen the scene and called them.","\n","^Mist?normal \"I'm afraid I have to go now. We'll meet again... I'm sure of it.\"","\n","^Mist?normal \"Goodbye, milady.\"","\n","^The air starts to swirl all around you, along with the masked man's cape. His body lifts in the air, going backwards to the buildings.","\n","^In a few seconds, the black dressed man is running on the rooftops, very far from the guards, now erupting in the square and pointing at him.","\n","^a dozen of armored man completely ignore you and starts the chase, while you remain still, looking at the black fugure moving rapidly in the distance.","\n","^You still have a black glove in your hand.","\n","end",{"#f":1}],"#f":1}],"WIN":[["^...Your sword points right at his face.","\n","^You won.","\n","^The masked figure slowly lowers his weapon and looks at you with admiration. His eyes are of a piercing grey that is the one of the sky during a storm.","\n","^Mist?normal \"Your sword skills are admirable milady, I admit defeat.\"","\n","^Player?normal \"You were a worthy opponent ... Mist. The name you're known by surely suits you; your attacks were devious and elusive, as the morning fog on a winter day.\"","\n","^Player?normal \"I wonder why you choose to operate against the law...\"","\n","^MistRevealed?normal \"There are a lot of things concealed to the sight milady. What looks like a flourishing kingdom, hides a lot of corruption.\"","\n","^MistRevealed?normal \"But, you're here to capture me. After all, you're part of the royal guard, that's your duty to stop criminals like me.\"","\n","^As Mist pronounce this last words, you hear some footsteps in the distance along with the sound of swords and armors clashing each other in the motion.","\n","^The guards are arriving, someone must have seen the scene and called them.","\n","^MistRevealed?normal \"You better be quick milady, they're almost here.\"","\n","ev","str","^Take off his mask","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Let him flee","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"WIN.Umasked"},{"#f":5}],"c-1":["\n",{"->":"WIN.Flee"},{"#f":5}]}],{"Umasked":["^You step forward, your sword still pointing at Mist's face.","\n","^Player?normal \"I can't let you go, I'm sorry.\"","\n","^You wait for the guards to arrive as they encircle the masked man; he has no way to escape now.","\n","^You move your sword to the side of his mask and ...","\n","^The air starts to swirl all around you, along with the masked man's cape. His body lifts in the air, going backwards to the buildings.","\n","^MistRevealed?normal \"One day you'll understand, milady.\"","\n","^MistRevealed?normal \"You'll hear again of me. Until then, goodbye.\"","\n","^In a few seconds, the black dressed man is running on the rooftops, far from you and the guards.","\n","^A dozen of armored man starts the chase with you, rurring towards the black figure in the distance.","\n","^You notice he's too fast for you to catch him and you stop, looking at him, disappearing from the sight.","\n","end",{"#f":1}],"Flee":["^You lower your sword and your eyes detatch from his gaze.","\n","^Player?normal \"Go, or they will get you.\"","\n","^You can feel a hint of hesitation in him, before he slowly starts to adjust his cloak and regains an elegant posture.","\n","^MistRevealed?normal \"I won't forget about that.\"","\n","^MistRevealed?normal \"Our swords will meet again, I'm sure of it. Until then, goodbye... Eleanor.\"","\n","^The air starts to swirl all around you, along with Mist's cape. His body lifts in the air, carried by a rope that extends behind his figure.","\n","^In a few seconds, the black dressed man is running on the rooftops, very far from the guards, now erupting in the square and pointing at him.","\n","^A dozen of armored man completely ignore you and starts the chase, while you remain still, looking at the black fugure moving rapidly in the distance.","\n","^You still have a black glove in your hand.","\n","end",{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}